Industruino/IndustruinoSAMD/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (C) 2017 Industruino <connect@industruino.com>  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Industruino D21G
# ----------------
industruino_d21g.name=Industruino D21G
industruino_d21g.vid.0=0x2E78
industruino_d21g.pid.0=0x804d
industruino_d21g.vid.1=0x2E78
industruino_d21g.pid.1=0x004d

industruino_d21g.upload.tool=bossac
industruino_d21g.upload.protocol=sam-ba
industruino_d21g.upload.maximum_size=262144
industruino_d21g.upload.use_1200bps_touch=true
industruino_d21g.upload.wait_for_upload_port=true
industruino_d21g.upload.native_usb=true
industruino_d21g.build.mcu=cortex-m0plus
industruino_d21g.build.f_cpu=48000000L
industruino_d21g.build.usb_product="Industruino D21G"
industruino_d21g.build.usb_manufacturer="ES Gear Ltd."
industruino_d21g.build.board=SAMD_INDUSTRUINO_D21G
industruino_d21g.build.core=industruino
industruino_d21g.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
industruino_d21g.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
industruino_d21g.build.openocdscript=openocd_scripts/industruino_d21g.cfg
industruino_d21g.build.variant=industruino_d21g
industruino_d21g.build.variant_system_lib=
industruino_d21g.build.vid=0x2E78
industruino_d21g.build.pid=0x804d
industruino_d21g.bootloader.tool=openocd
industruino_d21g.bootloader.file=d21g/samd21_sam_ba_industruino_d21g.bin
